playingaround/testing/app/controllers/books_controller.rb

    def list
        @books = Book.all
---
SELECT "books".* FROM "books"

    def new
        @book = Book.new
        @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

    def create
        @book = Book.new(book_params)

        if @book.save
            redirect_to action: 'list'
        else
            @subjects = Subject.all
---
INSERT INTO "books" ("title", "price", "subject_id", "description", "created_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Harry POtter"], ["price", 25.0], ["subject_id", 2], ["description", ""], ["created_at", 2016-09-18 07:47:17 UTC]]
SELECT "subjects".* FROM "subjects"

    def edit
        @book = Book.find(params[:id])
        @subjects = Subject.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "subjects".* FROM "subjects"

    def update
        @book = Book.find(params[:id])

        if @book.update_attributes(book_param)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "price" = $1 WHERE "books"."id" = $2  [["price", 0.0], ["id", 3]]

    def delete
        Book.find(params[:id]).destroy
---
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 2]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]