playingaround/testing/app/views/books/edit.html.erb

SELECT "subjects".* FROM "subjects"
---
<p>Price: <%= f.text_field  'date' %></p>
<p>Subject: <%= f.collection_select :subject_id, Subject.all, :id, :name %></p>